import give_timetable

start_time = 20190812
end_time = 20200117
start_day = 1
teacher = ['王挺', '刘晓才', '刘新旺', '张远军', '陆洪毅', '董威', '刘卫东']
cname = ['人工智能', '军事地形学', '机器学习', '毛概', '系统综合', '软件工程', '野战生存']
major = ['计算机科学与技术', '计算机科学与技术', '计算机科学与技术', '计算机科学与技术', '计算机科学与技术', '计算机科学与技术', '计算机科学与技术']
hours = [64, 24, 48, 80, 40, 64, 24]
type = [2, 1, 2, 2, 2, 2, 1]
single = [0, 1, 0, 0, 0, 0, 1]
cstart = [20190812, 20191118, 20190829, 20190815, 20190827, 20190828, 20191105]
cend = [20191028, 20191125, 20191110, 20191224, 20190919, 20191025, 20191107]
cmajor = [['计算机科学与技术'], ['计算机科学与技术'], ['计算机科学与技术'], ['计算机科学与技术'], ['计算机科学与技术'], ['计算机科学与技术'], ['计算机科学与技术']]
cplace = ['室内', '田径场', '室内', '室内', '室内', '室内', '田径场']
a = give_timetable.cal(start_time,end_time,start_day,teacher,cname,major,hours,type,single,cstart,cend,cmajor,cplace)['计算机科学与技术']
print(a)